datasets/hcc/opendj-sdk/queries/long/859.txt

This request is malformed:


<soap-env:Envelope
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
<soap-env:Body>
 <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
requestID="[substrings] element has no subfilter [initial], [any],
[final]">
  <searchRequest dn="uid=abergin,ou=People,o=dsmlfe.com"
scope="singleLevel" derefAliases="neverDerefAliases">
   <filter>
    <substrings name="sn"/>
   </filter>
  </searchRequest>
 </batchRequest>
</soap-env:Body>
</soap-env:Envelope>



We return:


<SOAP-ENV:Envelope
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Body>
<batchResponse xmlns="urn:oasis:names:tc:DSML:2:0:core" requestID="[substrings]
element has no subfilter [initial], [any], [final]">
 <errorResponse type="Unknown error">
  <message>org.opends.server.types.LDAPException:
Cannot decode the provided ASN.1 element as an LDAP search filter
because the element was null</message>
 </errorResponse>
</batchResponse>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>



The value of 'Unknown error' in the errorResponse is invalid according to the DSMLv2 schema.